InformationRegisters/ЗаданияКРасчетуДлительностиПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияКРасчетуДлительностиПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетДнейДоОкончания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерЗадания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияКРасчетуДлительностиПроизводства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет записи в регистр заданий.
//
// Параметры:
//  ОбъектРасчета	 - СправочникОбъект.ОбъектыРасчетов  - справочник, для которого необходимо добавить задание.
//  ПолныйРасчет	 - Булево							 - признак, необходимо рассчитать нормативную длительность этапов производства.
//  Автозапуск		 - Булево							 - автоматический запуск расчет фоновым заданием.
//
Процедура ДобавитьЗадание(ОбъектРасчета, ПолныйРасчет = Ложь, Автозапуск = Истина) Экспорт
	
	Задание = Новый Структура("ОбъектРасчета, ПолныйРасчет", ОбъектРасчета, ПолныйРасчет);
	
	Идентификаторы = ПроизводствоСервер.ДобавитьЗаданиеВОчередь("ЗаданияКРасчетуДлительностиПроизводства", Задание);
	
	Если Автозапуск Тогда
		
		ПроизводствоСервер.ЗапуститьЗаданиеОбработкиОчереди("ЗаданияКРасчетуДлительностиПроизводства", Задание, Идентификаторы);
		
	КонецЕсли;
	
КонецПроцедуры

// Запускает в фоновом режиме планирование производства
//
Процедура ЗапуститьЗадание() Экспорт
	
	ПроизводствоСервер.ЗапуститьЗаданиеОбработкиОчереди("ЗаданияКРасчетуДлительностиПроизводства");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОбработки() Экспорт
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Обработчик", "РегистрыСведений.НормативнаяДлительностьПроизводства.ВыполнитьРасчет");
	ПараметрыОбработки.Вставить("ДополнительныеДанные", Новый Структура);
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция ОчередьЗаданий(Отбор = Неопределено) Экспорт
	
	ЗаданияКОбработке = ПроизводствоСервер.ОчередьЗаданий("ЗаданияКРасчетуДлительностиПроизводства", Отбор);
	Возврат ЗаданияКОбработке;
	
КонецФункции

Функция ВыбратьИзОчереди(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОбрабатываемыеЗадания.ОбъектРасчета КАК ОбъектРасчета,
	|	МАКСИМУМ(ОбрабатываемыеЗадания.ПолныйРасчет) КАК ПолныйРасчет
	|ИЗ
	|	ОбрабатываемыеЗадания КАК ОбрабатываемыеЗадания
	|СГРУППИРОВАТЬ ПО
	|	ОбрабатываемыеЗадания.ОбъектРасчета");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Очередь = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Очередь.Добавить(Новый Структура("ОбъектРасчета, ПолныйРасчет", Выборка.ОбъектРасчета, Выборка.ПолныйРасчет));
	КонецЦикла;
	
	Возврат Очередь;
	
КонецФункции

Процедура УдалитьЗадание(Задание, МенеджерВременныхТаблиц) Экспорт
	
	ПроизводствоСервер.УдалитьЗадание("ЗаданияКРасчетуДлительностиПроизводства", Задание, МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ЗаписатьОшибку(Задание, ПропуститьЗадание, ИнформацияОбОшибке) Экспорт
	
	ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	
	ПроизводствоСервер.ЗаписатьОшибкуОбработкиОчередиЗаданий("ЗаданияКРасчетуДлительностиПроизводства", ТекстОшибки, Задание, Задание.ОбъектРасчета);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
